{
    "upper": [
      {
        "name": "Wall Push-ups",
        "muscle_group": ["Chest", "Triceps", "Shoulders"],
        "instructions": "Stand facing a wall, place your hands on the wall at shoulder height, and perform a push-up while keeping your body straight."
      },
      {
        "name": "Hindu Push-ups",
        "muscle_group": ["Chest", "Shoulders", "Triceps"],
        "instructions": "Start in a downward dog position, swoop your chest towards the floor, then push forward into an upward dog position."
      },
      {
        "name": "Decline Push-ups",
        "muscle_group": ["Upper Chest", "Shoulders", "Triceps"],
        "instructions": "Place your feet on an elevated surface like a bench and perform a push-up to focus more on the upper chest."
      },
      {
        "name": "Close-Grip Push-ups",
        "muscle_group": ["Triceps", "Chest"],
        "instructions": "Place your hands closer together under your chest and perform a push-up to target the triceps more than the chest."
      },
      {
        "name": "Side Planks",
        "muscle_group": ["Obliques", "Shoulders"],
        "instructions": "Lie on your side with your legs straight, propped up on one forearm. Lift your hips to form a straight line from head to feet, holding the position."
      },
      {
        "name": "Modified Plank Hold",
        "muscle_group": ["Shoulders", "Core"],
        "instructions": "Start in a forearm plank position, keep your body straight from head to toes, and hold the position while engaging your core and shoulders."
      },
      {
        "name": "Arm Circles",
        "muscle_group": ["Shoulders"],
        "instructions": "Stand with arms extended to the sides and make small circles forward, then backward, keeping your shoulders tight."
      },
      {
        "name": "Plank to Push-up",
        "muscle_group": ["Shoulders", "Triceps", "Core"],
        "instructions": "Start in a plank position on your forearms, then push up to your hands one at a time and return to the plank. Alternate arms with each rep."
      },
      {
        "name": "Inchworms",
        "muscle_group": ["Shoulders", "Core", "Hamstrings"],
        "instructions": "Start standing, bend down and walk your hands forward into a push-up position, perform a push-up, and walk your hands back to standing."
      }
    ]
  }
  